a = 5                        # '**' - возведение в степень / '%' - остаток от деления / round() - округление
a+=7                         # 'a+=число' == 'a = a+число'
print(a)                     # Переменные можно называть даже русскими символами
b = "6.6"   #тип float
print(" He is a \"normal\" guy")  #экранирование
print(" He is a \n normal guy")   #\n - enter
print("hi " + str(a))    #str() - превращает всё в string / int() / float()
# print("hi", a)        Можно с разными типами
print(a+float(b))
# vvod = input("Введите текст: ")     #Readln , можно ввести переменную, а текст между "()" будет выведен на экран
# print(vvod)                         #Всё что мы ввели является строкой, цифры тоже
# "pip install" - позволяет скачать модули(моды) для Питона, вводить в командую строку винды
# import pyown - для погоды (На будущее)
# alt + клик - выбор строчек
# ctrl + alt + L = выравнивание кода
# ctrl + clic по function  = найти функцию
# выделить переменную/ функцию или что-то другое + сtrl + F6 = переименовать везде

#! x = 10
#! print('Hello' if x == 10 else 'hi')           Краткая запись оператора if



# ВСЕ ДРУГИЕ ГОРЯЧИЕ КЛАВИШИ:
# Найти любое действие в IDE Ctrl + Shift + A
# РЕДАКТИРОВАНИЕ
# Показать действия намерения Alt + Enter
# Автозавершение кода Ctrl + Пробел
# Smart автозавершение кода Ctrl + Shift + Пробел
# Завершение имени типа Ctrl + Alt + Пробел
# Полная инструкция Ctrl + Shift + Enter
# Информация о параметрах/контекстная Ctrl + P / Alt + Q
# Быстрое определение Ctrl + Shift + I
# Быстрая/внешняя док-ция Ctrl + Q / Shift + F1
# Сгенерировать код Alt + Insert
# Переопределить/внедрить элем-ты Ctrl + O / Ctrl + I
# Окружить Ctrl + Alt + T
# Строковый комментарий Ctrl + /
# Расширить/сжать выделение Ctrl + W / Ctrl + Shift + W
# Оптимизировать импорт Ctrl + Alt + O
# Автоматический отступ строк Ctrl + Alt + I
# Вырезать/Копировать/Вставить Ctrl + X/Ctrl + C/Ctrl + V
# Копировать путь Ctrl + Shift + C
# Вставить из истории буфера Ctrl + Shift + V
# Дублировать текущую строку/выделение Ctrl + D
# Удалить строку при вставке Ctrl + Y
# Начать новую строку Shift + Enter
# Переключить регистр Ctrl + Shift + U
# Развернуть/свернуть код Ctrl + NumPad + / -
# Развернуть/свернуть все Ctrl + Shift + NumPad + / -
# Сохранить все Ctrl + S